const mongoose = require('mongoose');
//هر موقع که نیاز باشه با پایگاه داده کار کنیم باید مونگوسو ریکوایر کنیم
// لازم به ذکر است که مونگوس اینترفیسی هست که برای کار با پایگاه داده ازش استفاده کردیم

//نکته ی مهم الان نیازی نیست که مدلی که توی فایل مودل ساختیم رو ریگوایر کنیم
//چونکه مونگوس از یه چیزی استفاده میکنه بنام سینگل تون و زمانی که یک بار مودل ما ریکوایر بشه دیگه همش هست 
//الان هم توی فایل اپ ریکوایر شده
//پس اینجوری نمیاریمش بعنوان یکی از زیرمجموعه های مونگوس میاریمش
const Store = mongoose.model('Store');
//یاد اوری میکنم که مودا داخل فایل مودا میومد و یک کپی از جیزی که ساخته بودیم میگرفت

exports.homePage = (req, res) => {
  res.render('index');
}

exports.addStore = (req, res, next) => {
  //الان من نکست نوشتم در حالی که نداره این نشون میده من هنوز درک درستی از نکست ندارم
  //خب سوالی که پیش میاد اینه که کی از نکست اسفاده میکنیم
  // خب زمانی استفاده میکنیم که بخوایم بندازیم برای یک میدلور بعدی 
  //الان این چیزی که ما داریم رد میکنیم اخرین میدلور است و قراره ریسپانس بفرسته پس نیازری به نکست نیست 
  res.render('editStore', { titel: 'addStore'});
}

exports.createStore = (req, res) => { //پوستی که به ادد میاد این فانکشن هندل میکنه
  //نکست نداره چونکه ریسپانس داره
  //زمانی که با پایگاه داده کار میکنیم میایم و از جیسون استفاده میکنیم
  res.json(req.body);
}