const mongoose = require('mongoose');
mongoose.Promise = global.Promise;
//زمانی که میخواهیم با پایگاه داده ارتباط برقرار کنیم باید صبر کنیم چون بصورت اسینکرونس نیست
//میتوینم از لایبرری های اکسترنال استفاده کنیم و میتونیم از چیز های پیش فرض استفاده کنیم
//دلیل این که از پرامیس گلوبال استفاده میکنیم اینه که میخوایم از اسینک اویست استفاده کنیم 
const slug = require('slugs');
//اسلاگ چیزی است که برامون میومد و یو ار ال منحصر به فرد درست میکرد
//مثلا یک به دو و دو به سه تبدیل میشد
const storeSchema = new mongoose.Schema({
    name: {
        type: String,
        trim: true,
        // required: true اگه این جوری بگیم اروری که نشون کار بر میده خیلی قشنگ نیست و ارور مونگودیبی است
        required: 'Please Enter A store name!'
    },
    slug: String,
    description: {
        type: String,
        trim: true
    },
    tags: [String]
});
//خب حالا میخوایم بیایم و قبل از سیو شدن با استفاده از کتابخانه اسلاگ یک چیزی بسازیم و توی پایگاه داده 
//ذخیره کنیم 
storeSchema.pre('save', function(next){
  if(!this.isModified) {
    next();//اسکیپش کن
    return;//از این فانکشن بیا بیرون
    //سوالی که برام پیش اومد اینه که چرا از ریترن استفاده کردیم؟
    //خب این جا از ریترن استفاده میکنیم که بیاد بیرون
    //از کجا بیاد بیرون ؟
    //فکر میکنم باید از کل این پری سیو بیاد بیرون چون پایین ازش استفاده نکردیم
    //پایین استفاده نکردیم چون نمیخواستیم کلا بیاد بیرون و بعد از نکست بره بپره روی میدلوره بعدی 
    //الان کلا بدون دیدن ادامه این فانکشن میاد بیرون و میپره روی قیمت بعدی 
    //پس عملا این ربطی به مونگو دی بی و اینا نداره مال جاواساکریپته خودمونه
  }
  this.slug = slug(this.name);
  next();
  //TODO make more resilients so slugs are unique
});
//کد بالا میاد و نمیگذاره سیو بشه تا زمانی که کد داخل این جا انجام شده باشه
//ما اومیدم و از کتابخانه اسلاگ استفاده کردیم و نام را در ان رد کردیم و بر اساس ان نام
//یک یو ار ال از اسلاگ گرفتیم
// و ان را توی اسکیما ذخیره کردیم
//دقت کن از فانکشن معمولی استفاده کردیم به خاطر این که به دیس نیاز داشتیم
//دیس به استوری که میخواد ذخیره بشه اشاره میکنه

//قبلا از اکسپورتس دات یه فانکشن استفاده میکردیم
//الان میخوایم که یه چیزی بفرستیم که ابچکت توشه و چیز میز های زیادی داره داخلش
//برای همین از ماجول دات اکسپورتس استفاده میکنیم
//بطور کلی اگر چیز اصلی از یک فایل را بخواهیم اکسپورت کنیم ماجول گزینه ی بهتری است


//رفتم داکیومنتیشن خوندم مودل میاد و یک کپی از اسکیمایی که تعریف کردیم میسازه
//چیز اولی که گرفت اسم است و چیز دومی که گرفت اسکیمایی است که میخواد ازش کپی کنه
module.exports = mongoose.model('Store', storeSchema);